
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.recipes-redis-storage.azurerm_redis_cache.redis
* Replace
  * module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0]
  * module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0] must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "main" {
      ~ created_with_api_version               = "2021-08-01" -> (known after apply)
      ~ id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/recipes-shared-infrastructure-prod/providers/Microsoft.Insights/scheduledQueryRules/Application Insights daily cap reached - recipes-cft-prod" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
      ~ name                                   = "Application Insights daily cap reached - recipes-cft-prod" -> "Application-Insights-daily-cap-reached-recipes-cft-prod" # forces replacement
      - skip_query_validation                  = false -> null
        tags                                   = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/recipes-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "production"
            "managedBy"           = "CNP"
        }
      - target_resource_types                  = [] -> null
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0] must be replaced
-/+ resource "null_resource" "fix_scheduled_query_rules_alert_v2" {
      ~ id       = "721333733568999504" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "alert_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/recipes-shared-infrastructure-prod/providers/Microsoft.Insights/scheduledQueryRules/Application Insights daily cap reached - recipes-cft-prod" -> (known after apply)
        }
    }

  # module.recipes-redis-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/recipes-shared-infrastructure-prod/providers/Microsoft.Cache/redis/recipes-cft-session-storage-prod"
        name                               = "recipes-cft-session-storage-prod"
        tags                               = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/recipes-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "production"
            "managedBy"           = "CNP"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 299 -> 125
          ~ maxmemory_delta                         = 299 -> 125
          ~ maxmemory_reserved                      = 299 -> 125
            # (14 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":62,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->